modules/rev.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Body>
        <process xmlns="http://tempuri.org/"><SPID xsi:type="xsd:string" xmlns="">hsec</SPID>
            <SPPWD xsi:type="xsd:string" xmlns="">hsec</SPPWD>
            <func xsi:type="xsd:string" xmlns="">TaskDispatch</func>
            <request xsi:type="xsd:string" xmlns="">&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;&lt;Request&gt;&lt;function name=&quot;TaskDispatch&quot;/&gt;&lt;params&gt;&lt;TaskNum&gt;14072102202&lt;/TaskNum&gt;&lt;FindTime&gt;2014-07-21 09:07:50&lt;/FindTime&gt;&lt;EventSource&gt;&#x7F51;&#x7EDC;&#x4E0A;&#x62A5;&lt;/EventSource&gt;&lt;EventType&gt;2&lt;/EventType&gt;&lt;MainType&gt;11&lt;/MainType&gt;&lt;SubType&gt;112&lt;/SubType&gt;&lt;DistrictCode&gt;4&lt;/DistrictCode&gt;&lt;DistrictName&gt;&#x911E;&#x5DDE;&#x533A;&lt;/DistrictName&gt;&lt;StreetCode&gt;121&lt;/StreetCode&gt;&lt;StreetName&gt;&#x4E2D;&#x6CB3;&#x8857;&#x9053;&lt;/StreetName&gt;&lt;CommunityCode&gt;1210&lt;/CommunityCode&gt;&lt;CommunityName&gt;&#x4E2D;&#x6CB3;&#x8857;&#x9053;&#x5468;&#x8FB9;&#x5730;&#x5757;&lt;/CommunityName&gt;&lt;CoordinateX&gt;360550&lt;/CoordinateX&gt;&lt;CoordinateY&gt;3303717&lt;/CoordinateY&gt;&lt;EventAddress&gt;&#x752C;&#x5174;&#x897F;&#x8DEF;(&#x4E1C;&#x5357;)&lt;/EventAddress&gt;&lt;EventDescription&gt;&#x6865;&#x6D1E;&#x9876;&#x706F;&#x7834;&#x635F;&#xFF1A;&#x911E;&#x5DDE;&#x533A;&#x5EFA;&#x5174;&#x8DEF;&#x548C;&#x73AF;&#x57CE;&#x5357;&#x8DEF;&#x4EA4;&#x754C;&#x7684;&#x6865;&#x6D1E;&#x4E0B;&#x7684;4&#x4E2A;&#x9876;&#x706F;&#x635F;&#x574F;&#xFF08;nb&#x963F;&#x90B1;  http://weibo.com/1424620563/BeyOMaXjE&#xFF09;&lt;/EventDescription&gt;&lt;EventPositionMap&gt;http://10.19.13.165:9088/MediaRoot/1121/37/Event11213785/PosMap.gif&lt;/EventPositionMap&gt;&lt;SendTime&gt;2016-04-05 01:04:13&lt;/SendTime&gt;&lt;DealEndTime&gt;2016-04-07 12:04:00&lt;/DealEndTime&gt;&lt;SendMemo&gt;&#x911E;&#x5DDE;&#x533A;&#x6D3E;&#x9063;&#x5458;&#x7684;&#x610F;&#x89C1;&#xFF1A;&#x8BF7;&#x4E13;&#x4E1A;&#x90E8;&#x95E8;&#x6839;&#x636E;&#x60C5;&#x51B5;&#xFF0C;&#x59A5;&#x5584;&#x5904;&#x7406;&#x8BE5;&#x95EE;&#x9898;&#xFF0C;&#x5E76;&#x5728;&#x5904;&#x7406;&#x540E;&#x53CD;&#x9988;&#x6307;&#x6325;&#x4E2D;&#x5FC3;&#x3002;&lt;/SendMemo&gt;&lt;DealTimeLimit&gt;48&lt;/DealTimeLimit&gt;&lt;EventPictures num='4'&gt;&lt;picture name='11213785_1.jpg' url='http://10.19.13.165:9088/MediaRoot/1121/37/Event11213785/1_1_11213785_1.jpg'/&gt;&lt;picture name='201407211992.jpg' url='http://10.19.13.165:9088/MediaRoot/1121/37/Event11213785/4_1_201407211992.jpg'/&gt;&lt;picture name='201407217661.jpg' url='http://10.19.13.165:9088/MediaRoot/1121/37/Event11213785/4_2_201407217661.jpg'/&gt;&lt;picture name='201407217346.jpg' url='http://10.19.13.165:9088/MediaRoot/1121/37/Event11213785/4_3_201407217346.jpg'/&gt;&lt;/EventPictures&gt;&lt;EventMedias num='0'&gt;&lt;/EventMedias&gt;&lt;DealUnit&gt;1670&lt;/DealUnit&gt;&lt;/params&gt;&lt;/Request&gt;
            </request></process></soapenv:Body></soapenv:Envelope>
